<a href="https://colab.research.google.com/github/LaiseLopes/Python/blob/master/Aula_1_Python_Banco.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [4]:
banco = pd.read_excel('/content/Banco_R.xlsx')

In [5]:
banco.head()

   id   datanasc       sexo  ...  temp_servico cartao_credito  Emprestimos
0   1 1952-02-03  Masculino  ...            98          10000       5000.0
1   2 1958-05-23  Masculino  ...            98           8040       4020.0
2   3 1929-07-26   Feminino  ...            98           4290       2145.0
3   4 1947-04-15   Feminino  ...            98           4380       2190.0
4   5 1955-02-09  Masculino  ...            98           9000       4500.0

[5 rows x 10 columns]

In [ ]:
banco.tail()

      id   datanasc       sexo  ...  temp_servico cartao_credito  Emprestimos
507  472 1966-02-21  Masculino  ...            63           7830       3915.0
508  473 1937-11-25   Feminino  ...            63           4290       2145.0
509  473 1937-11-25   Feminino  ...            63           4290       2145.0
510  474 1968-11-05   Feminino  ...            63           5880       2940.0
511  474 1968-11-05   Feminino  ...            63           5880       2940.0

[5 rows x 10 columns]

In [ ]:
banco.dtypes

id                          int64
datanasc           datetime64[ns]
sexo                       object
estudo                      int64
Produto                    object
salario                   float64
salario_inicial             int64
temp_servico                int64
cartao_credito              int64
Emprestimos               float64
dtype: object

In [ ]:
banco_1 = banco.sort_values(by="id")
banco_1.head()

   id   datanasc       sexo  ...  temp_servico cartao_credito  Emprestimos
0   1 1952-02-03  Masculino  ...            98          10000       5000.0
1   2 1958-05-23  Masculino  ...            98           8040       4020.0
2   3 1929-07-26   Feminino  ...            98           4290       2145.0
3   4 1947-04-15   Feminino  ...            98           4380       2190.0
4   5 1955-02-09  Masculino  ...            98           9000       4500.0

[5 rows x 10 columns]

In [ ]:
banco.rename(columns={'datanasc':'data_nascimento'})

      id data_nascimento       sexo  ...  temp_servico cartao_credito  Emprestimos
0      1      1952-02-03  Masculino  ...            98          10000       5000.0
1      2      1958-05-23  Masculino  ...            98           8040       4020.0
2      3      1929-07-26   Feminino  ...            98           4290       2145.0
3      4      1947-04-15   Feminino  ...            98           4380       2190.0
4      5      1955-02-09  Masculino  ...            98           9000       4500.0
..   ...             ...        ...  ...           ...            ...          ...
507  472      1966-02-21  Masculino  ...            63           7830       3915.0
508  473      1937-11-25   Feminino  ...            63           4290       2145.0
509  473      1937-11-25   Feminino  ...            63           4290       2145.0
510  474      1968-11-05   Feminino  ...            63           5880       2940.0
511  474      1968-11-05   Feminino  ...            63           5880       2940.0

[512 rows x 10 columns]

In [ ]:
banco['sexo'].value_counts()

Masculino    278
Feminino     234
Name: sexo, dtype: int64

In [ ]:
banco['id'].mean()

235.63671875

In [ ]:
banco['id'].mean()

235.63671875

In [ ]:
banco['salario'].mean()

34954.0313111546

In [ ]:
banco['salario'].std()

18147.675516656152

In [ ]:
banco.describe()

               id      estudo  ...  cartao_credito   Emprestimos
count  512.000000  512.000000  ...      512.000000    512.000000
mean   235.636719   13.552734  ...     6996.683594   3498.341797
std    144.722127    2.890898  ...     3628.419932   1814.209966
min      1.000000    8.000000  ...     3150.000000   1575.000000
25%    106.750000   12.000000  ...     4800.000000   2400.000000
50%    234.500000   12.000000  ...     5820.000000   2910.000000
75%    362.250000   15.000000  ...     7590.000000   3795.000000
max    474.000000   21.000000  ...    27000.000000  13500.000000

[8 rows x 7 columns]

In [ ]:
banco.describe().estudo

count    512.000000
mean      13.552734
std        2.890898
min        8.000000
25%       12.000000
50%       12.000000
75%       15.000000
max       21.000000
Name: estudo, dtype: float64

In [ ]:
banco.shape

(512, 10)

In [ ]:
banco_1 = banco.dropna()
banco_1.head()

   id   datanasc       sexo  ...  temp_servico cartao_credito  Emprestimos
1   2 1958-05-23  Masculino  ...            98           8040       4020.0
2   3 1929-07-26   Feminino  ...            98           4290       2145.0
3   4 1947-04-15   Feminino  ...            98           4380       2190.0
4   5 1955-02-09  Masculino  ...            98           9000       4500.0
5   6 1958-08-22  Masculino  ...            98           6420       3210.0

[5 rows x 10 columns]

In [ ]:
banco_1.shape

(511, 10)

In [ ]:
missing_count = banco.isnull().sum()
missing_count

id                 0
datanasc           0
sexo               0
estudo             0
Produto            0
salario            1
salario_inicial    0
temp_servico       0
cartao_credito     0
Emprestimos        0
dtype: int64

In [ ]:
banco['salario'].fillna(banco['salario'].mean(), inplace = True)
banco.head()

   id   datanasc       sexo  ...  temp_servico cartao_credito  Emprestimos
0   1 1952-02-03  Masculino  ...            98          10000       5000.0
1   2 1958-05-23  Masculino  ...            98           8040       4020.0
2   3 1929-07-26   Feminino  ...            98           4290       2145.0
3   4 1947-04-15   Feminino  ...            98           4380       2190.0
4   5 1955-02-09  Masculino  ...            98           9000       4500.0

[5 rows x 10 columns]

In [ ]:
eliminando_linhas = banco.drop(2)
eliminando_linhas.head()

   id   datanasc       sexo  ...  temp_servico cartao_credito  Emprestimos
0   1 1952-02-03  Masculino  ...            98          10000       5000.0
1   2 1958-05-23  Masculino  ...            98           8040       4020.0
3   4 1947-04-15   Feminino  ...            98           4380       2190.0
4   5 1955-02-09  Masculino  ...            98           9000       4500.0
5   6 1958-08-22  Masculino  ...            98           6420       3210.0

[5 rows x 10 columns]

In [ ]:
eliminando_colunas = banco.drop(['datanasc','salario_inicial'],axis=1)
eliminando_colunas.head()

   id       sexo  estudo  ... temp_servico  cartao_credito  Emprestimos
0   1  Masculino      15  ...           98           10000       5000.0
1   2  Masculino      16  ...           98            8040       4020.0
2   3   Feminino      12  ...           98            4290       2145.0
3   4   Feminino       8  ...           98            4380       2190.0
4   5  Masculino      15  ...           98            9000       4500.0

[5 rows x 8 columns]

In [ ]:
banco.head()

   id   datanasc       sexo  ...  temp_servico cartao_credito  Emprestimos
0   1 1952-02-03  Masculino  ...            98          10000       5000.0
1   2 1958-05-23  Masculino  ...            98           8040       4020.0
2   3 1929-07-26   Feminino  ...            98           4290       2145.0
3   4 1947-04-15   Feminino  ...            98           4380       2190.0
4   5 1955-02-09  Masculino  ...            98           9000       4500.0

[5 rows x 10 columns]

In [ ]:
bins = [1,8,15,22]
grupo = ['inicio','intermediÃ¡rio','avanÃ§ado']
banco['fx_estudo']=pd.cut(banco['estudo'],bins,labels=grupo)
banco.head()

   id   datanasc       sexo  ...  cartao_credito Emprestimos      fx_estudo
0   1 1952-02-03  Masculino  ...           10000      5000.0  intermediÃ¡rio
1   2 1958-05-23  Masculino  ...            8040      4020.0       avanÃ§ado
2   3 1929-07-26   Feminino  ...            4290      2145.0  intermediÃ¡rio
3   4 1947-04-15   Feminino  ...            4380      2190.0         inicio
4   5 1955-02-09  Masculino  ...            9000      4500.0  intermediÃ¡rio

[5 rows x 11 columns]

In [ ]:
banco['fx_estudo'].value_counts()

intermediÃ¡rio    337
avanÃ§ado         120
inicio            55
Name: fx_estudo, dtype: int64

In [ ]:
dummy = pd.get_dummies(banco['sexo'])
dummy.head()

   Feminino  Masculino
0         0          1
1         0          1
2         1          0
3         1          0
4         0          1

In [ ]:
banco = pd.concat([banco, dummy], axis = 1)
banco.head()

   id   datanasc       sexo  ...      fx_estudo Feminino  Masculino
0   1 1952-02-03  Masculino  ...  intermediÃ¡rio        0          1
1   2 1958-05-23  Masculino  ...       avanÃ§ado        0          1
2   3 1929-07-26   Feminino  ...  intermediÃ¡rio        1          0
3   4 1947-04-15   Feminino  ...         inicio        1          0
4   5 1955-02-09  Masculino  ...  intermediÃ¡rio        0          1

[5 rows x 13 columns]

In [ ]:
# SeleÃ§Ã£o de variaveis e linhas
selecao = banco.loc[:,'id':'temp_servico']
selecao.head()

   id   datanasc       sexo  ...       salario salario_inicial  temp_servico
0   1 1952-02-03  Masculino  ...  34954.031311           27000            98
1   2 1958-05-23  Masculino  ...  40200.000000           18750            98
2   3 1929-07-26   Feminino  ...  21450.000000           12000            98
3   4 1947-04-15   Feminino  ...  21900.000000           13200            98
4   5 1955-02-09  Masculino  ...  45000.000000           21000            98

[5 rows x 8 columns]

In [ ]:
selecao1 = banco.loc[:,'id']
selecao1.head()

0    1
1    2
2    3
3    4
4    5
Name: id, dtype: int64

In [ ]:
selecao2 = banco[['temp_servico','salario','id']]
selecao2.head()

   temp_servico       salario  id
0            98  34954.031311   1
1            98  40200.000000   2
2            98  21450.000000   3
3            98  21900.000000   4
4            98  45000.000000   5

In [ ]:
selecao3 = banco[banco.sexo == 'Feminino']
selecao3.head()

   id   datanasc      sexo  ...      fx_estudo Feminino  Masculino
2   3 1929-07-26  Feminino  ...  intermediÃ¡rio        1          0
3   4 1947-04-15  Feminino  ...         inicio        1          0
7   8 1966-05-06  Feminino  ...  intermediÃ¡rio        1          0
8   9 1946-01-23  Feminino  ...  intermediÃ¡rio        1          0
9  10 1946-02-13  Feminino  ...  intermediÃ¡rio        1          0

[5 rows x 13 columns]

In [ ]:
selecao3['sexo'].value_counts()

Feminino    234
Name: sexo, dtype: int64

In [ ]:
selecao3.shape

(234, 13)

In [ ]:
selecao4 = banco[(banco.sexo == 'Feminino') & (banco.estudo >= 10)]
selecao4.head()

    id   datanasc      sexo  ...      fx_estudo Feminino  Masculino
2    3 1929-07-26  Feminino  ...  intermediÃ¡rio        1          0
7    8 1966-05-06  Feminino  ...  intermediÃ¡rio        1          0
8    9 1946-01-23  Feminino  ...  intermediÃ¡rio        1          0
9   10 1946-02-13  Feminino  ...  intermediÃ¡rio        1          0
10  11 1950-02-07  Feminino  ...       avanÃ§ado        1          0

[5 rows x 13 columns]

In [ ]:
selecao5 = banco[(banco.sexo == 'Feminino') | (banco.estudo >= 10)]
selecao5.head()

   id   datanasc       sexo  ...      fx_estudo Feminino  Masculino
0   1 1952-02-03  Masculino  ...  intermediÃ¡rio        0          1
1   2 1958-05-23  Masculino  ...       avanÃ§ado        0          1
2   3 1929-07-26   Feminino  ...  intermediÃ¡rio        1          0
3   4 1947-04-15   Feminino  ...         inicio        1          0
4   5 1955-02-09  Masculino  ...  intermediÃ¡rio        0          1

[5 rows x 13 columns]

In [ ]:
selecao4.shape

(202, 13)

In [ ]:
selecao5.shape

(489, 13)

In [ ]:
selecao6 = banco[(banco.sexo == 'Masculino')&(banco.salario >= 15000)][['id','sexo','salario']]
selecao6.head()

   id       sexo       salario
0   1  Masculino  34954.031311
1   2  Masculino  40200.000000
4   5  Masculino  45000.000000
5   6  Masculino  32100.000000
6   7  Masculino  36000.000000

In [ ]:
banco[banco.sexo == 'Feminino'].estudo.mean()

12.427350427350428

In [ ]:
banco[banco.sexo == 'Masculino'].estudo.mean()

14.5

In [ ]:
banco[['sexo','Produto','estudo']].groupby(['sexo','Produto']).mean()

                      estudo
sexo      Produto
Feminino  A        16.000000
          B        12.000000
          BB       12.000000
          C        12.237443
          CC       12.000000
Masculino A        17.512195
          B        10.115385
          C        13.712575
          CC       14.000000

In [ ]:
pd.crosstab(banco.sexo, banco.Produto, margins = True, margins_name = 'Total')

Produto     A   B  BB    C  CC  Total
sexo
Feminino   12   1   1  219   1    234
Masculino  82  26   0  167   3    278
Total      94  27   1  386   4    512

In [ ]:
banco['Produto'].value_counts()

C     386
A      94
B      27
CC      4
BB      1
Name: Produto, dtype: int64